<?php
/***********************************************************
 * copyright(C): Jeffry<w@jeffry.cn>
 * description:  配置文件
 * version:      v1.0.0
 * function:     包含方法列表
 *
 * @author:      Pante
 * @datetime:    2018/1/31 16:21
 * @others:      Use the PhpStorm
 *
 * history:      修改记录
 ***********************************************************/
return array(
    //网站配置信息
    'URL' => 'zb.com',         //网站根URL
    'COOKIE_SALT' => 'jeffry', //设置cookie加密密钥
    //备份配置
    'DB_PATH_NAME' => 'db',    //备份目录名称,主要是为了创建备份目录
    'DB_PATH' => './db/',      //数据库备份路径必须以 / 结尾；
    'DB_PART' => '20971520',   //该值用于限制压缩后的分卷最大长度。单位：B；建议设置20M
    'DB_COMPRESS' => '1',      //压缩备份文件需要PHP环境支持gzopen,gzwrite函数        0:不压缩 1:启用压缩
    'DB_LEVEL' => '9',         //压缩级别   1:普通   4:一般   9:最高
	'URL_MODEL' => '2',
    //扩展配置文件
    'LOAD_EXT_CONFIG' => 'db',
    //用户等级设置
    'USER_CLASS' => array(
        '1' => '平民',
        '2' => '骑士',
        '3' => '男爵',
        '4' => '子爵',
        '5' => '伯爵'
    ),
	'ANCHOR_BUSINESS_HOURS' => array(
		1   =>  '00:00', 2   =>  '00:30', 3   =>  '01:00', 4   =>  '01:30', 5   =>  '02:00', 6   =>  '02:30',
		7   =>  '03:00', 8   =>  '03:30', 9   =>  '04:00', 10  =>  '04:30', 11  =>  '05:00', 12  =>  '05:30',
		13  =>  '06:00', 14  =>  '06:30', 15  =>  '07:00', 16  =>  '07:30', 17  =>  '08:00', 18  =>  '08:30',
		19  =>  '09:00', 20  =>  '09:30', 21  =>  '10:00', 22  =>  '10:30', 23  =>  '11:00', 24  =>  '11:30',
		25  =>  '12:00', 26  =>  '12:30', 27  =>  '13:00', 28  =>  '13:30', 29  =>  '14:00', 30  =>  '14:30',
		31  =>  '15:00', 32  =>  '15:30', 33  =>  '16:00', 34  =>  '16:30', 35  =>  '17:00', 36  =>  '17:30',
		37  =>  '18:00', 38  =>  '18:30', 39  =>  '19:00', 40  =>  '19:30', 41  =>  '20:00', 42  =>  '20:30',
		43  =>  '21:00', 44  =>  '21:30', 45  =>  '22:00', 46  =>  '22:30', 47  =>  '23:00', 48  =>  '23:30',
	),
	'ANCHOR_PROFESSION' => array(
		0 => '其它',
		1 => '主播',
		2 => '学生',
		3 => '模特',
		4 => '护士',
		5 => '教师',
	),
	'ANCHOR_CHARM'  => array(
		0 => '无',
		1 => '眼睛',
		2 => '嘴',
		3 => '鼻子',
		4 => '耳朵',
		5 => '手',
		6 => '腿',
		7 => '腰部',
		8 => '胸部',
	),
	'ANCHOR_SERVE_WAY' => array(
        1 => '小时',
        2 => '天',
        3 => '次',
        4 => '局',
        5 => '首'
    ),
	'WE_CHAT' => array(
		'token'         => 'Jeffry',
		'encodingaeskey'=> 'kgbhMAHG2Q7jcIkMxnfXdM3QBl4L0I9XbJ2zOjVWSde',
		'appid'     => 'wxac5ee19ee8d559cf',
		'appsecret' => 'e5cdbf5f9db9c7b6459976660b57dd4f',
		'debug'         => true,
		'logcallback'   => false,
	),
	'WE_CHAT_ERR_CODE' => array(
		'-1'=>'系统繁忙',
		'0'=>'请求成功',
		'40001'=>'获取access_token时AppSecret错误，或者access_token无效',
		'40002'=>'不合法的凭证类型',
		'40003'=>'不合法的OpenID',
		'40004'=>'不合法的媒体文件类型',
		'40005'=>'不合法的文件类型',
		'40006'=>'不合法的文件大小',
		'40007'=>'不合法的媒体文件id',
		'40008'=>'不合法的消息类型',
		'40009'=>'不合法的图片文件大小',
		'40010'=>'不合法的语音文件大小',
		'40011'=>'不合法的视频文件大小',
		'40012'=>'不合法的缩略图文件大小',
		'40013'=>'不合法的APPID',
		'40014'=>'不合法的access_token',
		'40015'=>'不合法的菜单类型',
		'40016'=>'不合法的按钮个数',
		'40017'=>'不合法的按钮类型',
		'40018'=>'不合法的按钮名字长度',
		'40019'=>'不合法的按钮KEY长度',
		'40020'=>'不合法的按钮URL长度',
		'40021'=>'不合法的菜单版本号',
		'40022'=>'不合法的子菜单级数',
		'40023'=>'不合法的子菜单按钮个数',
		'40024'=>'不合法的子菜单按钮类型',
		'40025'=>'不合法的子菜单按钮名字长度',
		'40026'=>'不合法的子菜单按钮KEY长度',
		'40027'=>'不合法的子菜单按钮URL长度',
		'40028'=>'不合法的自定义菜单使用用户',
		'40029'=>'不合法的oauth_code',
		'40030'=>'不合法的refresh_token',
		'40031'=>'不合法的openid列表',
		'40032'=>'不合法的openid列表长度',
		'40033'=>'不合法的请求字符，不能包含\uxxxx格式的字符',
		'40035'=>'不合法的参数',
		'40038'=>'不合法的请求格式',
		'40039'=>'不合法的URL长度',
		'40050'=>'不合法的分组id',
		'40051'=>'分组名字不合法',
		'40099'=>'该 code 已被核销',
		'41001'=>'缺少access_token参数',
		'41002'=>'缺少appid参数',
		'41003'=>'缺少refresh_token参数',
		'41004'=>'缺少secret参数',
		'41005'=>'缺少多媒体文件数据',
		'41006'=>'缺少media_id参数',
		'41007'=>'缺少子菜单数据',
		'41008'=>'缺少oauth code',
		'41009'=>'缺少openid',
		'42001'=>'access_token超时',
		'42002'=>'refresh_token超时',
		'42003'=>'oauth_code超时',
		'42005'=>'调用接口频率超过上限',
		'43001'=>'需要GET请求',
		'43002'=>'需要POST请求',
		'43003'=>'需要HTTPS请求',
		'43004'=>'需要接收者关注',
		'43005'=>'需要好友关系',
		'44001'=>'多媒体文件为空',
		'44002'=>'POST的数据包为空',
		'44003'=>'图文消息内容为空',
		'44004'=>'文本消息内容为空',
		'45001'=>'多媒体文件大小超过限制',
		'45002'=>'消息内容超过限制',
		'45003'=>'标题字段超过限制',
		'45004'=>'描述字段超过限制',
		'45005'=>'链接字段超过限制',
		'45006'=>'图片链接字段超过限制',
		'45007'=>'语音播放时间超过限制',
		'45008'=>'图文消息超过限制',
		'45009'=>'接口调用超过限制',
		'45010'=>'创建菜单个数超过限制',
		'45015'=>'回复时间超过限制',
		'45016'=>'系统分组，不允许修改',
		'45017'=>'分组名字过长',
		'45018'=>'分组数量超过上限',
		'45024'=>'账号数量超过上限',
		'46001'=>'不存在媒体数据',
		'46002'=>'不存在的菜单版本',
		'46003'=>'不存在的菜单数据',
		'46004'=>'不存在的用户',
		'47001'=>'解析JSON/XML内容错误',
		'48001'=>'api功能未授权',
		'50001'=>'用户未授权该api',
		'61450'=>'系统错误',
		'61451'=>'参数错误',
		'61452'=>'无效客服账号',
		'61453'=>'账号已存在',
		'61454'=>'客服帐号名长度超过限制(仅允许10个英文字符，不包括@及@后的公众号的微信号)',
		'61455'=>'客服账号名包含非法字符(英文+数字)',
		'61456'=>'客服账号个数超过限制(10个客服账号)',
		'61457'=>'无效头像文件类型',
		'61458'=>'客户正在被其他客服接待',
		'61459'=>'客服不在线',
		'61500'=>'日期格式错误',
		'61501'=>'日期范围错误',
		'7000000'=>'请求正常，无语义结果',
		'7000001'=>'缺失请求参数',
		'7000002'=>'signature 参数无效',
		'7000003'=>'地理位置相关配置 1 无效',
		'7000004'=>'地理位置相关配置 2 无效',
		'7000005'=>'请求地理位置信息失败',
		'7000006'=>'地理位置结果解析失败',
		'7000007'=>'内部初始化失败',
		'7000008'=>'非法 appid（获取密钥失败）',
		'7000009'=>'请求语义服务失败',
		'7000010'=>'非法 post 请求',
		'7000011'=>'post 请求 json 字段无效',
		'7000030'=>'查询 query 太短',
		'7000031'=>'查询 query 太长',
		'7000032'=>'城市、经纬度信息缺失',
		'7000033'=>'query 请求语义处理失败',
		'7000034'=>'获取天气信息失败',
		'7000035'=>'获取股票信息失败',
		'7000036'=>'utf8 编码转换失败',
	),
	'OCCUPATIONAL_CLASS' => array(
		'00' =>  array(
			'one_name'  => '销售|客服|市场',
			'one_data'  => array(
				'0001' => array(
					'two_name'  => '销售业务',
					'two_data'  => array(
						'000101'    => '销售代表',
						'000102'    => '客户代表',
						'000103'    => '销售工程师',
						'000104'    => '渠道/分销专员',
						'000105'    => '区域销售专员/助理',
						'000106'    => '业务拓展专员/助理',
						'000107'    => '大客户销售代表',
						'000108'    => '电话销售',
						'000109'    => '网络/在线销售',
						'000110'    => '团购业务员',
						'000111'    => '销售业务跟单',
						'000112'    => '医药代表',
						'000113'    => '经销商',
						'000114'    => '招商经理',
						'000115'    => '招商主管',
						'000116'    => '招商专员',
						'000117'    => '会籍顾问',
						'000118'    => '其他'
					),
				),
				'0002' => array(
					'two_name'  => '销售管理',
					'two_data'  => array(
						'000201'    => '销售总监',
						'000202'    => '销售经理',
						'000203'    => '销售主管',
						'000204'    => '客户总监',
						'000205'    => '客户经理',
						'000206'    => '客户主管',
						'000207'    => '渠道/分销总监',
						'000208'    => '渠道/分销经理/主管',
						'000209'    => '区域销售总监',
						'000210'    => '区域销售经理/主管',
						'000211'    => '业务拓展经理/主管',
						'000212'    => '大客户销售经理',
						'000213'    => '团购经理/主管',
						'000214'    => '医药销售经理/主管',
						'000215'    => '其他'
					),
				),
				'0003' => array(
					'two_name'  => '销售行政/商务',
					'two_data'  => array(
						'000301'    => '销售行政经理/主管',
						'000302'    => '销售行政专员/助理',
						'000303'    => '销售运营经理/主管',
						'000304'    => '销售运营专员/助理',
						'000305'    => '商务经理/主管',
						'000306'    => '商务专员/助理',
						'000307'    => '销售培训师/讲师',
						'000308'    => '销售数据分析',
						'000309'    => '业务分析经理/主管',
						'000310'    => '业务分析专员/助理',
						'000311'    => '其他'
					),
				),
				'0004' => array(
					'two_name'  => '客服/售前/售后技术支持',
					'two_data'  => array(
						'000401'    => '客户服务总监',
						'000402'    => '客户服务经理',
						'000403'    => '客户服务主管',
						'000404'    => '客户服务专员/助理',
						'000405'    => '客户关系/投诉协调人员',
						'000406'    => '客户咨询热线/呼叫中心人员',
						'000407'    => '网络/在线客服',
						'000408'    => '售前/售后技术支持管理',
						'000409'    => '售前/售后技术支持工程师',
						'000410'    => 'VIP专员',
						'000411'    => '呼叫中心客服',
						'000412'    => '其他',
					),
				),
				'0005' => array(
					'two_name'  => '市场',
					'two_data'  => array(
						'000501'    => '销售业务',
						'000502'    => '销售管理',
						'000503'    => '销售行政/商务',
						'000504'    => '客服/售前/售后技术支持',
						'000505'    => '市场',
						'000506'    => '公关/媒介',
						'000507'    => '广告/会展',
					),
				),
				'0006' => array(
					'two_name'  => '公关/媒介',
					'two_data'  => array(
						'000601'    => '公关总监',
						'000602'    => '公关经理/主管',
						'000603'    => '公关专员/助理',
						'000604'    => '媒介经理/主管',
						'000605'    => '媒介专员/助理',
						'000606'    => '媒介策划/管理',
						'000607'    => '政府事务管理',
						'000608'    => '媒介销售',
						'000609'    => '活动执行',
						'000610'    => '其他',
					),
				),
				'0007' => array(
					'two_name'  => '广告/会展',
					'two_data'  => array(
						'000701'    => '广告创意/设计总监',
						'000702'    => '广告创意/设计经理/主管',
						'000703'    => '广告创意/设计师',
						'000704'    => '广告文案策划',
						'000705'    => '广告美术指导',
						'000706'    => '广告制作执行',
						'000707'    => '广告客户总监',
						'000708'    => '广告客户经理',
						'000709'    => '广告客户主管',
						'000710'    => '广告客户代表',
						'000711'    => '广告/会展业务拓展',
						'000712'    => '会展策划/设计',
						'000713'    => '会务经理/主管',
						'000714'    => '会务专员/助理',
						'000715'    => '广告/会展项目管理',
						'000716'    => '企业/业务发展经理',
						'000717'    => '其他',
					),
				),
			)
		),
		'01' =>  array(
			'one_name'  => '财务|人力资源|行政',
			'one_data'  => array(
				'0101' => array(
					'two_name'  => '财务/审计/税务',
					'two_data'  => array(
						'010101'    => '首席财务官CFO',
						'010102'    => '财务总监',
						'010103'    => '财务经理',
						'010104'    => '财务主管/总帐主管',
						'010105'    => '财务顾问',
						'010106'    => '财务助理',
						'010107'    => '财务分析经理/主管',
						'010108'    => '财务分析员',
						'010109'    => '会计经理/主管',
						'010110'    => '会计/会计师',
						'010111'    => '会计助理/文员',
						'010112'    => '出纳员',
						'010113'    => '审计经理/主管',
						'010114'    => '审计专员/助理',
						'010115'    => '税务经理/主管',
						'010116'    => '税务专员/助理',
						'010117'    => '成本经理/主管',
						'010118'    => '成本会计',
						'010119'    => '资产/资金管理',
						'010120'    => '资金专员',
						'010121'    => '统计员',
						'010122'    => '固定资产会计',
						'010123'    => '成本管理员',
						'010124'    => '其他',
					),
				),
				'0102' => array(
					'two_name'  => '人力资源',
					'two_data'  => array(
						'010201'    => '人力资源总监',
						'010202'    => '人力资源经理',
						'010203'    => '人力资源主管',
						'010204'    => '人力资源专员/助理',
						'010205'    => '培训经理/主管',
						'010206'    => '培训专员/助理',
						'010207'    => '招聘经理/主管',
						'010208'    => '招聘专员/助理',
						'010209'    => '薪酬福利经理/主管',
						'010210'    => '薪酬福利专员/助理',
						'010211'    => '绩效考核经理/主管',
						'010212'    => '绩效考核专员/助理',
						'010213'    => '员工关系/企业文化/工会',
						'010214'    => '企业培训师/讲师',
						'010215'    => '人事信息系统(HRIS)管理',
						'010216'    => '猎头顾问/助理',
						'010217'    => '其他',
					),
				),
				'0103' => array(
					'two_name'  => '行政/后勤/文秘',
					'two_data'  => array(
						'010301'    => '行政总监',
						'010302'    => '行政经理/主管/办公室主任',
						'010303'    => '行政专员/助理',
						'010304'    => '助理/秘书/文员',
						'010305'    => '前台/总机/接待',
						'010306'    => '文档/资料管理',
						'010307'    => '电脑操作/打字/录入员',
						'010308'    => '后勤人员',
						'010309'    => '党工团干事',
						'010310'    => '图书管理员',
						'010311'    => '内勤人员',
						'010312'    => '其他',
					),
				),
			)
		),
		'02' =>  array(
			'one_name'  => '项目|质量|高级管理',
			'one_data'  => array(
				'0201' => array(
					'two_name'  => '项目管理/项目协调',
					'two_data'  => array(
						'020101'    => '项目总监',
						'020102'    => '项目经理/项目主管',
						'020103'    => '项目专员/助理',
						'020104'    => '广告/会展项目管理',
						'020105'    => 'IT项目总监',
						'020106'    => 'IT项目经理/主管',
						'020107'    => 'IT项目执行/协调人员',
						'020108'    => '通信项目管理',
						'020109'    => '房地产项目配套工程师',
						'020110'    => '房地产项目管理',
						'020111'    => '证券/投资项目管理',
						'020112'    => '保险项目经理/主管',
						'020113'    => '生产项目经理/主管',
						'020114'    => '生产项目工程师',
						'020115'    => '汽车工程项目管理',
						'020116'    => '电子/电器项目管理',
						'020117'    => '服装/纺织/皮革项目管理',
						'020118'    => '医药项目管理',
						'020119'    => '化工项目管理',
						'020120'    => '物流/仓储项目管理',
						'020121'    => '咨询项目管理',
						'020122'    => '能源/矿产项目管理',
						'020123'    => '项目计划合约专员',
						'020124'    => '项目招投标',
						'020125'    => '其他',
					),
				),
				'0202' => array(
					'two_name'  => '质量管理/安全防护',
					'two_data'  => array(
						'020201'    => '质量管理/测试经理',
						'020202'    => '质量管理/测试主管',
						'020203'    => '质量管理/测试工程师',
						'020204'    => '质量检验员/测试员',
						'020205'    => '化验/检验',
						'020206'    => '认证/体系工程师/审核员',
						'020207'    => '环境/健康/安全经理/主管',
						'020208'    => '环境/健康/安全工程师',
						'020209'    => '供应商/采购质量管理',
						'020210'    => '安全管理',
						'020211'    => '安全消防',
						'020212'    => '可靠度工程师',
						'020213'    => '故障分析工程师',
						'020214'    => '采购材料/设备管理',
						'020215'    => '其他',
					),
				),
				'0203' => array(
					'two_name'  => '高级管理',
					'two_data'  => array(
						'020301'    => '首席执行官CEO/总裁/总经理',
						'020302'    => '首席运营官COO',
						'020303'    => '首席财务官CFO',
						'020304'    => 'CTO/CIO',
						'020305'    => '副总裁/副总经理',
						'020306'    => '分公司/代表处负责人',
						'020307'    => '部门/事业部管理',
						'020308'    => '总裁助理/总经理助理',
						'020309'    => '总编/副总编',
						'020310'    => '行长/副行长',
						'020311'    => '工厂厂长/副厂长',
						'020312'    => '校长/副校长',
						'020313'    => '合伙人',
						'020314'    => '办事处首席代表',
						'020315'    => '投资者关系',
						'020316'    => '企业秘书/董事会秘书',
						'020317'    => '策略发展总监',
						'020318'    => '运营总监',
						'020319'    => '其他',
					),
				),
			)
		),
		'03' =>  array(
			'one_name'  => 'IT|互联网|通信',
			'one_data'  => array(
				'0301' => array(
					'two_name'  => '软件/互联网开发/系统集成',
					'two_data'  => array(
						'030101'    => '高级软件工程师',
						'030102'    => '软件工程师',
						'030103'    => '软件研发工程师',
						'030104'    => '需求工程师',
						'030105'    => '系统架构设计师',
						'030106'    => '系统分析员',
						'030107'    => '数据库开发工程师',
						'030108'    => 'ERP技术/开发应用',
						'030109'    => '互联网软件工程师',
						'030100'    => '手机软件开发工程师',
						'030111'    => '嵌入式软件开发',
						'030112'    => '移动互联网开发',
						'030113'    => 'WEB前端开发',
						'030114'    => '语音/视频/图形开发',
						'030115'    => '用户界面（UI）设计',
						'030116'    => '用户体验（UE/UX）设计',
						'030117'    => '网页设计/制作/美工',
						'030118'    => '游戏设计/开发',
						'030119'    => '游戏策划',
						'030120'    => '游戏界面设计',
						'030121'    => '系统集成工程师',
						'030122'    => '算法工程师',
						'030123'    => '仿真应用工程师',
						'030124'    => '计算机辅助设计师',
						'030125'    => '网站架构设计师',
						'030126'    => 'IOS开发工程师',
						'030127'    => 'Android开发工程师',
						'030128'    => 'Java开发工程师',
						'030129'    => 'PHP开发工程师',
						'030130'    => 'C语言开发工程师',
						'030131'    => '脚本开发工程师',
						'030132'    => '其他',
					),
				),
				'0302' => array(
					'two_name'  => '硬件开发',
					'two_data'  => array(
						'030201'    => '高级硬件工程师',
						'030202'    => '硬件工程师',
						'030203'    => '嵌入式硬件开发',
						'030204'    => '其他',
					),
				),
				'0303' => array(
					'two_name'  => '互联网产品/运营管理',
					'two_data'  => array(
						'030301'    => '互联网产品经理/主管',
						'030302'    => '产品专员/助理',
						'030303'    => '电子商务经理/主管',
						'030304'    => '电子商务专员/助理',
						'030305'    => '网络运营管理',
						'030306'    => '网络运营专员/助理',
						'030307'    => '网站编辑',
						'030308'    => 'SEO/SEM',
						'030309'    => '产品总监',
						'030310'    => '',
					),
				),
				'0304' => array(
					'two_name'  => 'IT质量管理/测试/配置管理',
					'two_data'  => array(
						'030401'    => ''
					),
				),
				'0305' => array(
					'two_name'  => 'IT运维/技术支持',
					'two_data'  => array(
						'030501'    => ''
					),
				),
				'0306' => array(
					'two_name'  => 'IT管理/项目协调',
					'two_data'  => array(
						'030601'    => ''
					),
				),
				'0307' => array(
					'two_name'  => '电信/通信技术开发及应用',
					'two_data'  => array(
						'030701'    => ''
					),
				),
			)
		),
		'04' =>  array(
			'one_name'  => '房产|建筑|物业管理',
			'one_data'  => array(
				'0401' => array(
					'two_name'  => '房地产开发/经纪/中介',
					'two_data'  => array(
						'040101'    => ''
					),
				),
				'0402' => array(
					'two_name'  => '土木/建筑/装修/市政工程',
					'two_data'  => array(
						'040201'    => ''
					),
				),
				'0403' => array(
					'two_name'  => '物业管理',
					'two_data'  => array(
						'040301'    => ''
					),
				)
				
			)
		),
		'05' =>  array(
			'one_name'  => '金融',
			'one_data'  => array(
				'0501' => array(
					'two_name'  => '银行',
					'two_data'  => array(
						'050101'    => ''
					),
				),
				'0502' => array(
					'two_name'  => '证券/期货/投资管理/服务',
					'two_data'  => array(
						'050201'    => ''
					),
				),
				'0503' => array(
					'two_name'  => '保险',
					'two_data'  => array(
						'050301'    => ''
					),
				),
				'0504' => array(
					'two_name'  => '信托/担保/拍卖/典当',
					'two_data'  => array(
						'050401'    => ''
					),
				),
			)
		),
		'06' =>  array(
			'one_name'  => '采购|贸易|交通|物流',
			'one_data'  => array(
				'0601' => array(
					'two_name'  => '采购/贸易',
					'two_data'  => array(
						'060101'    => ''
					),
				),
				'0602' => array(
					'two_name'  => '交通运输服务',
					'two_data'  => array(
						'060201'    => ''
					),
				),
				'0603' => array(
					'two_name'  => '物流/仓储',
					'two_data'  => array(
						'060301'    => ''
					),
				),
			)
		),
		'07' =>  array(
			'one_name'  => '生产|制造',
			'one_data'  => array(
				'0701' => array(
					'two_name'  => '生产管理/运营',
					'two_data'  => array(
						'070101'    => ''
					),
				),
				'0702' => array(
					'two_name'  => '电子/电器/半导体/仪器仪表',
					'two_data'  => array(
						'070201'    => ''
					),
				),
				'0703' => array(
					'two_name'  => '汽车制造',
					'two_data'  => array(
						'070301'    => ''
					),
				),
				'0704' => array(
					'two_name'  => '汽车销售与服务',
					'two_data'  => array(
						'070401'    => ''
					),
				),
				'0705' => array(
					'two_name'  => '机械设计/制造/维修',
					'two_data'  => array(
						'070501'    => ''
					),
				),
				'0706' => array(
					'two_name'  => '服装/纺织/皮革设计/生产',
					'two_data'  => array(
						'070601'    => ''
					),
				),
				'0707' => array(
					'two_name'  => '技工/操作工',
					'two_data'  => array(
						'070701'    => ''
					),
				),
				'0708' => array(
					'two_name'  => '生物/制药/医疗器械',
					'two_data'  => array(
						'070801'    => ''
					),
				),
				'0709' => array(
					'two_name'  => '化工',
					'two_data'  => array(
						'070901'    => ''
					),
				),
			)
		),
		'08' =>  array(
			'one_name'  => '传媒|印刷|艺术|设计',
			'one_data'  => array(
				'0801' => array(
					'two_name'  => '影视/媒体/出版/印刷',
					'two_data'  => array(
						'080101'    => ''
					),
				),
				'0802' => array(
					'two_name'  => '艺术/设计',
					'two_data'  => array(
						'080201'    => ''
					),
				),
			)
		),
		'09' =>  array(
			'one_name'  => '咨询|法律|教育|翻译',
			'one_data'  => array(
				'0901' => array(
					'two_name'  => '咨询/顾问/调研/数据分析',
					'two_data'  => array(
						'090101'    => ''
					),
				),
				'0902' => array(
					'two_name'  => '教育/培训',
					'two_data'  => array(
						'090201'    => ''
					),
				),
				'0903' => array(
					'two_name'  => '律师/法务/合规',
					'two_data'  => array(
						'090301'    => ''
					),
				),
				'0904' => array(
					'two_name'  => '翻译（口译与笔译）',
					'two_data'  => array(
						'090401'    => ''
					),
				),
			)
		),
		'10' =>  array(
			'one_name'  => '服务业',
			'one_data'  => array(
				'1001' => array(
					'two_name'  => '商超/酒店/娱乐管理/服务',
					'two_data'  => array(
						'100101'    => ''
					),
				),
				'1002' => array(
					'two_name'  => '旅游/度假/出入境服务',
					'two_data'  => array(
						'100201'    => ''
					),
				),
				'1003' => array(
					'two_name'  => '烹饪/料理/食品研发',
					'two_data'  => array(
						'100301'    => ''
					),
				),
				'1004' => array(
					'two_name'  => '保健/美容/美发/健身',
					'two_data'  => array(
						'100401'    => ''
					),
				),
				'1005' => array(
					'two_name'  => '医院/医疗/护理',
					'two_data'  => array(
						'100501'    => ''
					),
				),
				'1006' => array(
					'two_name'  => '社区/居民/家政服务',
					'two_data'  => array(
						'100601'    => ''
					),
				),
			)
		),
		'11' =>  array(
			'one_name'  => '能源|环保|农业|科研',
			'one_data'  => array(
				'1101' => array(
					'two_name'  => '能源/矿产/地质勘查',
					'two_data'  => array(
						'110101'    => ''
					),
				),
				'1102' => array(
					'two_name'  => '环境科学/环保',
					'two_data'  => array(
						'110201'    => ''
					),
				),
				'1103' => array(
					'two_name'  => '农/林/牧/渔业',
					'two_data'  => array(
						'110301'    => ''
					),
				),
				'1104' => array(
					'two_name'  => '公务员/事业单位/科研机构',
					'two_data'  => array(
						'110401'    => ''
					),
				),
			)
		),
		'12' =>  array(
			'one_name'  => '兼职|实习|社工|其他',
			'one_data'  => array(
				'1201' => array(
					'two_name'  => '实习生/培训生/储备干部',
					'two_data'  => array(
						'120101'    => ''
					),
				),
				'1202' => array(
					'two_name'  => '志愿者/社会工作者',
					'two_data'  => array(
						'120201'    => ''
					),
				),
				'1203' => array(
					'two_name'  => '兼职/临时',
					'two_data'  => array(
						'120301'    => ''
					),
				),
				'1204' => array(
					'two_name'  => '其他',
					'two_data'  => array(
						'120401'    => ''
					),
				),
			)
		),
	)
);